# AnalyticalModelColumnBaseExtension Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelColumnBaseExtension Property
ParameterTypeId Class See Also
---
"Base x Projection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelColumnBaseExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelColumnBaseExtension As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelColumnBaseExtension {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace